#+TITLE: Αναγνώριση θερμών και ψυχρών ρευμάτων
#+AUTHOR: Βιδιάνος Γιαννίτσης

Σκοπό του αρχείου αυτού αποτελεί η σταδιακή αναγνώριση θερμών και ψυχρών ρευμάτων (καθώς και των ιδιοτήτων αυτών) σε κάθε block της διεργασίας. Για υπενθύμιση θα αναφέρεται και το description του κάθε block.

* Τελική εικόνα
Έχοντας δει όλα τα blocks ξεχωριστά, μπορούμε να φτιάξουμε τον συνολικό πίνακα ψυχρών και θερμών ρευμάτων ο οποίος είναι
#+CAPTION: Συνολικός Πίνακας Θερμών και Ψυχρών της διεργασίας
|--------------+-------+----------+-----------+------------------+---------------------|
| Ρεύμα        | Είδος | Τ_in (C) | Τ_out (C) | Παροχή (kmol/hr) | Σύσταση             |
|--------------+-------+----------+-----------+------------------+---------------------|
| FeedSteam    | Ψυχρό |       20 |       232 |           633.22 | Νερό                |
|--------------+-------+----------+-----------+------------------+---------------------|
| Vapors       | Θερμό |      232 |        30 |           905.27 | Νερό 0.92           |
|              |       |          |           |                  | CO_2 0.08           |
|--------------+-------+----------+-----------+------------------+---------------------|
| CellLig      | Θερμό |      232 |     80.65 |            84.76 | Κυτταρίνη 0.5       |
|              |       |          |           |                  | Λιγνίνη 0.5         |
|--------------+-------+----------+-----------+------------------+---------------------|
| NaOH         | Ψυχρό |       20 |     80.65 |            80.37 | Νερό                |
|--------------+-------+----------+-----------+------------------+---------------------|
| Bleach       | Ψυχρό |       20 |      69.9 |            55.62 | Νερό 99.5           |
|              |       |          |           |                  | Χλωρίνη 0.05        |
|--------------+-------+----------+-----------+------------------+---------------------|
| Cellulose    | Θέρμο |    80.65 |      69.9 |            54.32 | Κυτταρίνη 0.78      |
|              |       |          |           |                  | Λιγνίνη 0.22        |
|--------------+-------+----------+-----------+------------------+---------------------|
| PureCell     | Θερμό |    61.97 |     49.75 |            42.55 | Κυτταρίνη           |
|--------------+-------+----------+-----------+------------------+---------------------|
| SachWater    | Ψυχρό |       20 |     49.75 |              715 | Νερό                |
|--------------+-------+----------+-----------+------------------+---------------------|
| Glucose      | Θερμό |       50 |        30 |           669.45 | Νερό 0.97           |
|              |       |          |           |                  | Γλυκόζη 0.03        |
|--------------+-------+----------+-----------+------------------+---------------------|
| RProd        | Ψυχρό |       30 |       140 |           774.29 | Νερό 0.89           |
|              |       |          |           |                  | CO_2 0.08           |
|              |       |          |           |                  | Γλυκερόλη 0.02      |
|              |       |          |           |                  | Άλλα 0.01           |
|--------------+-------+----------+-----------+------------------+---------------------|
| FlashVaps    | Θερμό |      140 |        30 |           745.99 | Νερό 0.91           |
|              |       |          |           |                  | CO_2 0.089          |
|              |       |          |           |                  | Άλλα 0.01           |
|--------------+-------+----------+-----------+------------------+---------------------|
| GlycWater    | Θερμό |    144.4 |        30 |             9.82 | Νερό                |
|--------------+-------+----------+-----------+------------------+---------------------|
| PureGlycerol | Θερμό |    288.9 |        30 |             15.9 | Γλυκερόλη           |
|--------------+-------+----------+-----------+------------------+---------------------|
| XylFeed      | Ψυχρό |      232 |       243 |            26.38 | Ξυλόζη              |
|--------------+-------+----------+-----------+------------------+---------------------|
| FurFeed      | Θερμό |      243 |       160 |           105.52 | Νερό 0.75           |
|              |       |          |           |                  | Φουρφουράλη 0.25    |
|--------------+-------+----------+-----------+------------------+---------------------|
| CyclReac     | Θερμό |      160 |        30 |          2132.66 | Κυκλοπεντανόνη 0.2  |
|              |       |          |           |                  | Νερό 0.79           |
|              |       |          |           |                  | Υδρογόνο 0.01       |
|--------------+-------+----------+-----------+------------------+---------------------|
| Cycl         | Θερμό |      130 |        30 |               26 | Κυκλοπεντανόνη 0.98 |
|              |       |          |           |                  | Φουρφουράλη 0.015   |
|              |       |          |           |                  | Τολουόλιο 0.005     |
|--------------+-------+----------+-----------+------------------+---------------------|
| Tol          | Θερμό |       50 |        30 |            51.02 | Τολουόλιο 0.98      |
|              |       |          |           |                  | Νερό 0.01           |
|              |       |          |           |                  | Κυκλοπεντανόνη 0.01 |
|--------------+-------+----------+-----------+------------------+---------------------|

Με αυτά τα δεδομένα μπορούν να υπολογιστούν οι ειδικές θερμοχωρητικότητες για όλα τα ρεύματα και έπειτα και οι θερμοχωρητικότητες. Αρχικά, παρατίθεται ένας πίνακας με την θερμοχωρητικότητα κάθε ουσίας που μας ενδιαφέρει
#+CAPTION: Θερμοχωρητικότητες ουσιών
| Ουσία          | Cp (J/mol K) |
|----------------+--------------|
| Νερό           |        75.38 |
| Κυτταρίνη      |        89.63 |
| Λιγνίνη        |        90.98 |
| Γλυκόζη        |          225 |
| Γλυκερόλη      |        225.4 |
| CO_2           |        37.35 |
| Ξυλόζη         |        178.1 |
| Φουρφουράλη    |        159.5 |
| Κυκλοπεντανόνη |       112.18 |
| Υδρογόνο       |         14.5 |
| Τολουόλιο      |        158.4 |
|----------------+--------------|

και από αυτά υπολογίζονται οι ειδικές θερμοχωρητικότητες και οι θερμοχωρητικότητες των ρευμάτων
#+CAPTION: Θερμοχωρητικότητες ρευμάτων
| Ρεύμα       | Παροχή (kmol/h) | Cp (J/mol K) | CP (MJ/h K) |
|-------------+-----------------+--------------+-------------|
| FeedSteam   |          633.22 |        75.38 |   47.732124 |
| StExpVapors |          905.27 |        72.34 |   65.487232 |
| CellLig     |           84.76 |        90.31 |   7.6546756 |
| NaOH        |           80.37 |        75.38 |   6.0582906 |
| Bleach      |           55.62 |        75.38 |   4.1926356 |
| Cellulose   |           54.32 |        89.93 |   4.8849976 |
| PureCell    |           42.55 |        89.63 |   3.8137565 |
| SachWater   |             715 |        75.38 |     53.8967 |
| Glucose     |          669.45 |        79.87 |   53.468972 |
| RProd       |          774.29 |        74.58 |   57.746548 |
| FlashVapors |          745.99 |        71.96 |   53.681440 |
| GlycWater   |            9.82 |        75.38 |   0.7402316 |
| PureGlyc    |            15.9 |        225.4 |     3.58386 |
| XylFeed     |           26.38 |        178.1 |    4.698278 |
| FurFeed     |          105.52 |        96.41 |   10.173183 |
| CyclReac    |           24.61 |       112.71 |   2.7737931 |
| CyclWater   |           106.9 |        76.12 |    8.137228 |
#+TBLFM: $4=($2*$3)/1000

Επίσης, μπορεί να κατασκευαστεί και ο πίνακας των ανηγμένων θερμοκρασιών του συστήματος
#+CAPTION: Πίνακας ανηγμένων θερμοκρασιών
| Ρεύμα        | Είδος | Τ_in (C) | T_out (C) |
|--------------+-------+----------+-----------|
| FeedSteam    | Ψυχρό |       25 |       237 |
| StExpVapors  | Θερμό |      227 |        25 |
| CellLig      | Θερμό |      227 |     75.65 |
| NaOH         | Ψυχρό |       25 |     85.65 |
| Bleach       | Ψυχρό |       25 |      74.9 |
| Cellulose    | Θερμό |    75.65 |      64.9 |
| PureCell     | Θερμό |    56.97 |     44.75 |
| SachWater    | Ψυχρό |       25 |     54.75 |
| Glucose      | Θερμό |       45 |        25 |
| RProd        | Ψυχρό |       35 |       145 |
| FlashVaps    | Θερμό |      135 |        25 |
| GlycWater    | Θερμό |    139.4 |        25 |
| PureGlycerol | Θερμό |    283.9 |        25 |
| XylFeed      | Ψυχρό |      237 |       248 |
| FurFeed      | Θερμό |      238 |       155 |
| Cyclo        | Θερμό |    262.8 |        25 |
| CyclWater    | Θερμό |    196.5 |        25 |

Με τα δεδομένα αυτά, φαίνεται σε άλλο αρχείο πως έγινε η ενεργειακή ολοκλήρωση.
